package java_lesson_hw_4;

public class Exercise_6 {
     /*Для всех задач исходные условия следующие: пользователь с клавиатуры вводит размер
массива (просто целое число). После того, как размер массива задан, заполнить его
одним из двух способов: используя Math.random(), или каждый элемент массива вводится
пользователем вручную. Попробовать оба варианта. После заполнения массива
данными, решить для него следующие задачи:
Задача 6:
Проверить, является ли массив возрастающей последовательностью (каждое следующее
число больше предыдущего).*/
    /*Задача *:
    Имеется массив из неотрицательных чисел(любой). Представьте что массив
    представляет целое число (Например массив {1,2,3} -> 123, {9,9,9} -> 999). Задача
    добавить единицу к этому “числу” и на выходе получить исправленный массив. Массив не
    содержит нуля в начале, кроме самого числа 0.
    Пример:
    Input: [1,4,0,5,6,3]
    Output: [1,4,0,5,6,4]
    Input: [9,9,9]
    Output: [1,0,0,0]*/
}
